app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@gmail.com' LIMIT 1
SELECT "roles"."name" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = 9
---
  def login
    user = User.find_by(email: params[:email])

    if user&.authenticate(params[:password])
      token = JsonWebToken.encode(user_id: user.id)
      response = {
        token: token,
        user: {
          id: user.id,
          email: user.email,
          name: user.name,
          roles: user.roles.pluck(:name)