app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "total_copies", "created_at", "updated_at") VALUES ('livro', 'Machado didi', 0, '2025-09-21 21:01:09.393258', '2025-09-21 21:01:09.393258') RETURNING "id"

  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1