app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title ILIKE '%livro%' OR author ILIKE '%livro%')
SELECT "copies".* FROM "copies" WHERE "copies"."book_id" IN (4, 5)
SELECT "book_categories".* FROM "book_categories" WHERE "book_categories"."book_id" IN (1, 2)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3)
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"
SELECT "book_categories".* FROM "book_categories" WHERE "book_categories"."book_id" IN (4, 5)
---
  def index
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @books = Book.includes(:categories, :copies)
                   .where("title ILIKE ? OR author ILIKE ?", search_term, search_term)
    else
      @books = Book.includes(:categories, :copies).all
    end

    render json: @books.map do |book|

INSERT INTO "books" ("title", "author", "total_copies", "created_at", "updated_at") VALUES ('livro 2', 'autor 2', 0, '2025-09-22 17:43:59.207225', '2025-09-22 17:43:59.207225') RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id]) if decoded