app/controllers/categories_controller.rb

SELECT "book_categories".* FROM "book_categories" WHERE "book_categories"."category_id" IN (1, 2, 3)
SELECT "books".* FROM "books"
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "books" INNER JOIN "book_categories" ON "books"."id" = "book_categories"."book_id" WHERE "book_categories"."category_id" = 1
---
  def index
    categories = Category.all.includes(:books)
    render json: categories.map { |cat| category_with_count(cat) }

SELECT COUNT(*) FROM "books" INNER JOIN "book_categories" ON "books"."id" = "book_categories"."book_id" WHERE "book_categories"."category_id" = 1
---
  def category_with_count(category)
    {
      id: category.id,
      name: category.name,
      book_count: category.books.count

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id]) if decoded

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1
---
  def set_category
    @category = Category.find(params[:id])