app/controllers/clients_controller.rb

  def index
    if params[:search].present?
      query = params[:search].strip
      @clients = Client.where("full_name ILIKE :q OR cpf ILIKE :q", q: "%#{query}%")
    else
      @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)
    if @client.save
---
INSERT INTO "clients" ("fullName", "cpf", "phone", "email", "password_digest", "created_at", "updated_at") VALUES ('Gabriel Henrique Oliveira Jales Ramalho', '12334567890', '84998332658', 'ponderous1734@gmail.com', '$2a$12$X6LmGoCKRXPnRBdHrqGRQOOhTwy08I/9hye2H3lb33IrZO1YKvQ9e', '2025-09-21 17:43:45.930553', '2025-09-21 17:43:45.930553') RETURNING "id"

  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1