app/controllers/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ponderous1734@gmail.com' LIMIT 1
---
  def forgot
    user = User.find_by(email: params[:email])