app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    roles = Role.all

SELECT "roles".* FROM "roles" WHERE "roles"."id" IN (1, 5)
---
  def set_role
    @role = Role.find(params[:id])