app/controllers/users_controller.rb

SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."user_id" IN (1, 2, 4, 5, 6, 9, 11)
SELECT "users".* FROM "users"
---
  def index
    @users = User.includes(:roles).all

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "password_changed") VALUES ('novo', 'teste1@gmail.com', '$2a$12$ScvNe44qzaPR1UBe7tLNXuLfybkmT.BcuSy9rjRta9sxjC/wqUy/q', '2025-09-20 18:13:53.429741', '2025-09-20 18:13:53.429741', NULL) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if user_params[:password].blank? || user_params[:password_confirmation].blank?
      return render json: { error: "Senha e confirmação são obrigatórias" }, status: :unprocessable_entity
    end

    if user_params[:password] != user_params[:password_confirmation]
      return render json: { error: "Senha e confirmação não coincidem" }, status: :unprocessable_entity
    end

    if @user.save

UPDATE "users" SET "email" = 'admin2@example.com', "updated_at" = '2025-09-20 19:32:56.375846' WHERE "users"."id" = 1
---
  def update
    user_attrs = user_params.to_h.compact
    role_ids = params[:role_ids] || (params[:user] && params[:user][:role_ids])

    if user_attrs.blank? && role_ids.blank?
      render json: { message: "Nenhuma alteração recebida" }, status: :no_content
      return
    end

    password_being_changed = user_attrs[:password].present?

    if @user.update(user_attrs)
      @user.update(password_changed: true) if password_being_changed

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find(decoded[:user_id]) if decoded

SELECT "roles"."id" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = 5
INSERT INTO "user_roles" ("user_id", "role_id", "created_at", "updated_at") VALUES (24, 5, '2025-09-20 22:06:40.198959', '2025-09-20 22:06:40.198959') RETURNING "id"
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = 5
---
  def assign_roles(user)
    return unless params[:role_ids].present? || (params[:user] && params[:user][:role_ids].present?)

    new_role_ids = params[:role_ids] || params[:user][:role_ids]
    new_role_ids = Array(new_role_ids).map(&:to_i).reject(&:blank?)
    puts "Role IDs recebidos na requisição: #{new_role_ids.inspect}"

    current_role_ids = user.roles.pluck(:id)
    puts "Roles atuais do usuário antes da atualização: #{current_role_ids.inspect}"

    to_add = new_role_ids - current_role_ids
    puts "Roles que serão adicionadas: #{to_add.inspect}"
    to_add.each do |role_id|
      UserRole.create(user_id: user.id, role_id: role_id)
      puts "Role #{role_id} associada ao usuário #{user.id}"
    end

    to_remove = current_role_ids - new_role_ids
    puts "Roles que serão removidas: #{to_remove.inspect}"
    UserRole.where(user_id: user.id, role_id: to_remove).destroy_all