app/controllers/users_controller.rb

SELECT "roles"."id" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = 12
INSERT INTO "user_roles" ("user_id", "role_id", "created_at", "updated_at") VALUES (12, 5, '2025-09-20 15:51:05.073407', '2025-09-20 15:51:05.073407') RETURNING "id"
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = 12
---
  def assign_roles(user)
    return unless params[:role_ids].present? || (params[:user] && params[:user][:role_ids].present?)

    new_role_ids = params[:role_ids] || params[:user][:role_ids]
    new_role_ids = Array(new_role_ids).map(&:to_i).reject(&:blank?)
    puts "Role IDs recebidos na requisição: #{new_role_ids.inspect}"

    current_role_ids = user.roles.pluck(:id)
    puts "Roles atuais do usuário antes da atualização: #{current_role_ids.inspect}"

    to_add = new_role_ids - current_role_ids
    puts "Roles que serão adicionadas: #{to_add.inspect}"
    to_add.each do |role_id|
      UserRole.create(user_id: user.id, role_id: role_id)
      puts "Role #{role_id} associada ao usuário #{user.id}"
    end

    to_remove = current_role_ids - new_role_ids
    puts "Roles que serão removidas: #{to_remove.inspect}"
    UserRole.where(user_id: user.id, role_id: to_remove).destroy_all